import React, { useCallback, useEffect, useState } from 'react';
import { View } from 'react-native';
import { Button, TouchableOpacity } from 'react-native-ui-lib';
import { LinearGradient } from 'expo-linear-gradient';
import { LogoMaeOn } from '@/components/SvgComponents';
import TextTheme from '@/components/TextTheme';
import tw from 'twrnc';
import Svg, { Path, Defs, SvgProps, ClipPath, G } from 'react-native-svg';
import { useStatusBar } from '@/hooks/useStatusBar';
import NetInfo from '@react-native-community/netinfo';
import { router } from 'expo-router';
import Loading from '@/components/Loading';
import useShowToast from '@/hooks/useShowToast';

const Mountain = (props: SvgProps) => (
    <Svg {...props}>
        <Defs>
            <ClipPath id="a">
                <Path d="M0 500h750V0H0Z" />
            </ClipPath>
        </Defs>
        <G clipPath="url(#a)" transform="matrix(1.33333 0 0 -1.33333 0 666.667)">
            <Path
                d="m0 0-7.053 4.538L-.26 2.063l-9.553 9.815L3.403 4.21l8.87-10.866Zm-34.074 24.397-2.993 1.749-3.458 6.152-5.523 1.038 1.86-5.631-3.664 1.489-4.961-2.583 3.868 4.757-.765 4.237 10.373 3.977 15.596-24.328zm-2.364 56.558 4.126 4.278-4.126-8.898zm-148.995 2.214-10.483 5.522-5.085 3.499-3.963-.82-6.574 5.782-4.442 1.654-.411 2.706-2.009 2.747 5.754 11.208-.054 9.403 5.48 5.727-2.87-7.408 2.092-3.472 4.264-10.633 2.842-1.135 9.309-10.305.642-3.746 7.681-7.995 10.265-10.415zm-38.038 42.139-3.922 7.189-4.046 4.223-1.832-3.02.848-7.804-7.162 6.246-4.756-10.456-.438 4.059 3.882 8.597.055 5.098-6.124 8.802 1.039 7.764 5.932 11.371 8.269-8.282.328-4.948 4.21-5.085.984-8.788 4.346-7.258zm148.68-33.664 2.761 7.681 2.897 4.032 3.841-.793zM36.247 32.857l-1.708.014-5.345.068-14.707 17.81-4.55-.369-13.833 8.706-7.394-.328-18.93 17.7 3.158 7.586-9.636 11.208-9.295 1.394-.669 3.239-4.634 1.449-7.873 15.923-5.535 14.871-1.708 9.13-9.979 4.934-1.899 2.119-5.398 6.041-18.234-20.12-12.56-6.396-13.053-17.987 7.612-14.133 24.685-19.011 2.077-4.688 6.547-3.65 5.741-11.85 10.278-5.481 13.094-14.283-19.805 10.319.943-3.157 2.884-6.834-6.615 5.222-6.615 1.612 10.005-18.848-16.389 15.65-7.735 12.26-5.126 3.963-.246-4.154-23.823 26.091-7.708 1.9-8.612 6.588-8.227 14.092-8.953 9.54-5.084-.437-11.55 8.529 5.782-11.126-10.757 7.449 1.927-6.356-15.622 8.351.902 6.589-2.502 5.863-1.749-.67 2.46 8.119-2.802-2.775-.56 5.823-3.909 1.353 3.13.957-.342 11.358-13.08 9.075-1.053-7.394-3.963-5.112 1.367 11.604 2.774 4.716-2.925 2.214-2.979-3.458-7.709 11.084 5.891 16.921-2.351-1.23.314 8.885-3.198-2.898-4.961-9.786-15.062-20.01-12.001-8.42-7.804-16.798v-.013l-1.135-2.446-12.342-20.229-18.014-14.475-8.146-10.988 12.861-11.195 20.598 9.418c4.989-3.786 9.964-7.572 14.952-11.359l51.569-37.777 25.587-13.641 14.57.328 50.352-38.927 16.798-12.984 4.716 1.9 3.663-3.348 10.593-3.827 9.813-5.631 17.714 15.089 6.232 13.517 15.363-22.647 4.551 2.118 4.552-5.973 10.524 8.405 5.344 9.336 3.691-.382 3.444 4.004 4.797-1.654 9.649-14.447 10.32-6.438 5.016-7.025 3.732 7.545 3.13-2.857 5.713-.396 3.253-4.333 1.955-.342.34 2.557 2.94-4.443 2.063.766 56.134 20.994z"
                fill="#313b52"
                fillOpacity={1}
                fillRule="nonzero"
                stroke="none"
                transform="translate(591.57 199.09)"
            />
            <Path
                d="m0 0-46.581-17.413-29.29-4.838-43.573-10.169-53.975-16.374-52.621 11.522-18.165-8.638-11.604 11.357-71.866-28.743-92.491 44.968-45.391-11.878-17.672 8.16-15.281-4.675-13.723 7.928-20.515-5.919-13.641 7.176-15.239-3.253s-24.398 2.433-23.96 2.774a507.772 507.772 0 0 0 16.005 6.643l4.606 9.896 28.839 18.971 16.525 26.106 26.584 31.354 13.175-.191 8.229 5.084 32.215 35.919 7.613-.014 33.5 33.173 2.201-54.822 11.18-42.166 22.962-18.807-4.879 35.66-11.194 10.06-14.584 24.725 21.95-18.821-15.185 32.42 12.479-11.686-5.822 14.338-8.475 12.929 5.878-3.922 3.704 2.145 2.556-1.065 4.1 2.392 8.939 5.207 3.69-17.85 5.126-4.798 8.2 9.349 20.598 9.417c-.219-.492-.287-20.761-.287-20.761l25.737-31.45 3.266-18.739.041-.245-4.906-16.962 22.429-15.774-.807 17.632-5.686 5.207-9.526 17.769 13.791-12.246-13.408 35.099-1.395 10.073 26.502-26.653 12.712-13.176 24.478-17.74-7.202 18.834 12.697.93 6.821-1.791 30.807-26.885-8.064 14.105 29.03-18.602 16.798-12.985 4.716 1.901 3.663-3.349 10.593-3.827 9.813-5.631 17.714 15.089 6.233 13.518 15.362-22.648 4.552 2.118 4.551-5.972 10.524 8.405 5.345 9.336 3.69-.383 3.444 4.005 4.797-1.654 9.65-14.448 10.319-6.437 5.017-7.025 3.731 7.544 3.13-2.856 5.713-.396 3.253-4.333 1.955-.342.341 2.556z"
                fill="#212b43"
                fillOpacity={1}
                fillRule="nonzero"
                stroke="none"
                transform="translate(639.326 158.948)"
            />
            <Path
                d="m0 0-20.994 20.064-4.524 10.552-8.775 8.146-5.248 10.292 8.815-6.26-3.034 7.75 10.894-8.16 8.555-11.317L.027 18.725zm92.437-81.338-2.885 6.834-.943 3.157 19.805-10.319L95.32-67.383l-10.278 5.481-5.741 11.85-6.547 3.65-2.077 4.688-24.685 19.011L38.38-8.57 28.43 9.937l-7.203 8.282-7.559 15.924-18.001 13.052-9.991 13.422-8.72 13.764-21.35 14.597-.382-6.027 7.517-4.511.656-9.021.875-3.717 2.57-4.005-3.991.314-.971 3.636-11.932 12.916-4.92 1.353-.041.014-2.105.588-4.88 2.392-.314-8.885 2.351 1.23-5.891-16.921 7.709-11.084 2.979 3.458 2.925-2.214-2.774-4.716-1.367-11.604 3.963 5.112 1.053 7.394 13.08-9.075.342-11.358-3.13-.957 3.909-1.353.56-5.823 2.802 2.775-2.46-8.119 1.749.67 2.502-5.863-.902-6.589 15.622-8.351-1.927 6.356 10.757-7.449L-14.242.67l11.55-8.529 5.084.437 8.953-9.54 8.227-14.092 8.612-6.588 7.708-1.9 23.823-26.091.246 4.154 5.126-3.963 7.735-12.26 16.389-15.65-10.005 18.848 6.615-1.612z"
                fill="#fff"
                fillOpacity={1}
                fillRule="nonzero"
                stroke="none"
                transform="translate(425.655 317.51)"
            />
            <Path
                d="m0 0-5.345.068-14.707 17.81-4.551-.369-13.832 8.706-7.394-.328-18.93 17.7 3.157 7.586-9.635 11.208-9.295 1.394-.669 3.239-4.634 1.449-7.873 15.923-5.535 14.871-1.708 9.13-9.979 4.934-1.899 2.118 6.984 4.688 23.96-19.189 21.349-36.07 7.435-.615 15.5-24.028 11.44-9.335 7.258-6.629z"
                fill="#fff"
                fillOpacity={1}
                fillRule="nonzero"
                stroke="none"
                transform="translate(626.11 231.962)"
            />
            <Path
                d="m0 0-3.991.314-.971 3.636-11.932 12.916-4.92 1.353 10.579 9.062-.383-6.027 7.517-4.511.657-9.02.875-3.718z"
                fill="#313b52"
                fillOpacity={1}
                fillRule="nonzero"
                stroke="none"
                transform="translate(392.497 379.207)"
            />
            <Path
                d="m0 0-1.613-7.708-3.922 7.189-4.046 4.223-1.832-3.02.848-7.805-7.162 6.246-4.756-10.456-.438 4.06 3.882 8.597.055 5.098-6.124 8.802 1.039 7.764 5.932 11.371 8.269-8.282.328-4.948 4.21-5.085.984-8.788z"
                fill="#ecf0f8"
                fillOpacity={1}
                fillRule="nonzero"
                stroke="none"
                transform="translate(369.712 332.107)"
            />
            <Path
                d="m0 0-12.438 7.682-10.483 5.522-5.085 3.498-3.963-.82-6.574 5.782-4.442 1.654-.411 2.706-2.009 2.747 5.755 11.208-.055 9.403 5.48 5.727-2.87-7.408 2.092-3.472 4.264-10.633 2.843-1.135 9.308-10.305.642-3.745 7.681-7.996z"
                fill="#ecf0f8"
                fillOpacity={1}
                fillRule="nonzero"
                stroke="none"
                transform="translate(418.575 274.579)"
            />
            <Path
                d="m0 0-.027-18.725-20.994 20.064-4.524 10.552-8.775 8.146-5.248 10.292 8.815-6.26-3.034 7.75 10.893-8.16 8.556-11.317z"
                fill="#313b52"
                fillOpacity={1}
                fillRule="nonzero"
                stroke="none"
                transform="translate(425.683 336.235)"
            />
            <Path
                d="m0 0-50.353 38.927-14.569-.328-25.587 13.64-51.569 37.778c-4.988 3.786-9.964 7.572-14.952 11.358-.219-.492-.287-20.761-.287-20.761l25.736-31.45 3.267-18.739.041-.245-4.907-16.962 22.43-15.774-.807 17.632-5.686 5.207-9.527 17.769 13.791-12.246-13.408 35.099-1.394 10.073 26.502-26.653 12.712-13.176 24.478-17.74-7.202 18.834 12.697.93 6.821-1.791 30.807-26.885-8.064 14.106z"
                fill="#fff"
                fillOpacity={1}
                fillRule="nonzero"
                stroke="none"
                transform="translate(471.483 191.204)"
            />
            <Path
                d="m0 0-10.333 9.144-2.993 1.749-3.458 6.151-5.523 1.038 1.86-5.631-3.663 1.489-4.962-2.583 3.868 4.757-.765 4.238 10.373 3.976z"
                fill="#fff"
                fillOpacity={1}
                fillRule="nonzero"
                stroke="none"
                transform="translate(567.83 214.345)"
            />
            <Path
                d="m0 0-12.273 6.656-7.053 4.538 6.793-2.474-9.554 9.814 13.217-7.668z"
                fill="#fff"
                fillOpacity={1}
                fillRule="nonzero"
                stroke="none"
                transform="translate(603.844 192.435)"
            />
            <Path
                d="m0 0-4.127-8.898v4.62z"
                fill="#fff"
                fillOpacity={1}
                fillRule="nonzero"
                stroke="none"
                transform="translate(559.259 284.324)"
            />
            <Path
                d="m0 0-9.499-10.92 2.761 7.681L-3.841.793z"
                fill="#fff"
                fillOpacity={1}
                fillRule="nonzero"
                stroke="none"
                transform="translate(526.278 301.655)"
            />
            <Path
                d="m0 0-11.194 10.06-14.584 24.725 21.951-18.821-15.185 32.42 12.479-11.686-5.823 14.338-8.474 12.929 5.877-3.922 3.704 2.145 2.556-1.065 4.101 2.392-26.871 16.62 2.2-54.823 11.18-42.165L4.879-35.66z"
                fill="#fff"
                fillOpacity={1}
                fillRule="nonzero"
                stroke="none"
                transform="translate(272.493 227.74)"
            />
            <Path
                d="m0 0-1.135-2.446-12.342-20.229-18.014-14.474-8.146-10.989 12.861-11.195-8.201-9.348-5.125 4.797-3.69 17.85 12.998 18.958z"
                fill="#fff"
                fillOpacity={1}
                fillRule="nonzero"
                stroke="none"
                transform="translate(320.631 342.495)"
            />
        </G>
    </Svg>
)

const ConnectionError: React.FC = () => {
    useStatusBar("light-content");
    const [loading, setLoading] = useState(false);
    const showToast = useShowToast

    const navigateBack = useCallback(() => {
        const canGoBack = router.canGoBack();
        if (canGoBack) {
            router.back();
        } else {
            router.replace("/(home)");
        }
    }, []);

    const checkConnection = useCallback(async () => {
        setLoading(true);
        const state = await NetInfo.fetch();
        if (state.isConnected) {
            showToast("success", "สำเร็จ!", "เชื่อมต่ออินเทอร์เน็ตสำเร็จแล้ว");
            setTimeout(() => {
                setLoading(false);
                navigateBack();
            }, 1000);
        } else {
            setTimeout(() => {
                setLoading(false);
            }, 1000);
            showToast("error", "ลองอีกครั้ง!", "โปรดตรวจสอบการเชื่อมต่ออินเทอร์เน็ตของคุณ");
        }
    }, [showToast, navigateBack]);

    useEffect(() => {
        const unsubscribe = NetInfo.addEventListener(state => {
            if (state.isConnected) {
                showToast("success", "สำเร็จ!", "เชื่อมต่ออินเทอร์เน็ตสำเร็จแล้ว");
                setLoading(true);
                setTimeout(() => {
                    setLoading(false);
                    navigateBack();
                }, 3000);
            } else {
                setLoading(false);
            }
        });
        return () => {
            unsubscribe();
        };
    }, [showToast, navigateBack]);

    const handleRetry = () => {
        checkConnection();
    };

    return (
        <View style={tw`flex-1`}>
            <LinearGradient
                colors={[String(tw.color("blue-600")), String(tw.color("blue-400")), String(tw.color("blue-900"))]}
                style={tw`flex-1 justify-center items-center p-4`}
            >
                <View style={tw`z-10 items-center`}>
                    <LogoMaeOn fill="white" width={100} height={100} style={tw`mb-6`} />
                    <TextTheme style={tw`text-2xl mb-2 text-center text-white`} font='Prompt-Bold'>
                        ไม่มีการเชื่อมต่ออินเตอร์เน็ต!
                    </TextTheme>
                    <TextTheme style={tw`text-base text-gray-200 mb-6 text-center`}>
                        โปรดตรวจสอบการเชื่อมต่ออินเทอร์เน็ตของคุณ
                    </TextTheme>
                    <TouchableOpacity onPress={handleRetry} style={tw`bg-white py-3 px-6 rounded-full`}>
                        {loading ? (
                            <Loading loading={loading} size={'small'} style={tw`p-0.5`} />
                        ) : (
                            <TextTheme font='Prompt-SemiBold' style={tw`text-black`}>ลองใหม่อีกครั้ง</TextTheme>
                        )}
                    </TouchableOpacity>
                </View>
                <Mountain style={tw`absolute bottom-[-140] right-[-60] z-0`} width={1000} height={1000} />
            </LinearGradient>
        </View>
    );
};

export default ConnectionError;